# FieldDelimiter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewScheduleExportOptions..::..FieldDelimiter Property
ViewScheduleExportOptions Class See Also
---
How to delimit fields. Default is Tab.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string FieldDelimiter { get; set; }
```

Visual Basic
---
```text
Public Property FieldDelimiter As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FieldDelimiter {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace